# Project 3 Part 3 - MySQL database

----------------

In [1]:
# Imports

# Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Additional Imports
import os, json, math, time

In [2]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [7]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/movies"

In [8]:
engine = create_engine(connection)

In [9]:
create_database(connection)

In [10]:
database_exists(connection)

True

In [11]:
df_basics = pd.read_csv('C:\\Users\\javwyk\\OneDrive - MMI HOLDINGS LTD\\GitHub\\Github-practice-assignment\\data\\title_basics.csv.gz', low_memory=False)

In [13]:
df_akas = pd.read_csv('C:\\Users\\javwyk\\OneDrive - MMI HOLDINGS LTD\\GitHub\\Github-practice-assignment\\data\\title_akas.csv.gz', low_memory=False)

In [16]:
df_ratings = pd.read_csv('C:\\Users\\javwyk\\OneDrive - MMI HOLDINGS LTD\\GitHub\\Github-practice-assignment\\data\\title_ratings.csv.gz', low_memory=False)

In [51]:
## create a col with a list of genres
df_basics['genres_split'] = df_basics['genres'].str.split(',')
df_basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror,[Horror]
...,...,...,...,...,...,...,...,...,...,...
87358,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
87359,tt9915872,movie,The Last White Witch,Boku no kanojo wa mahoutsukai,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
87360,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
87361,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
87362,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [52]:
exploded_genres = df_basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
87361,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
87361,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
87361,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
87362,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
87362,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [53]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [54]:
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [55]:
## Save just tconst and genres_split as new df
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [56]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [57]:
## make new integer genre_id and drop string genres

title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [58]:
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0068865         7
...          ...       ...
87361  tt9916190         0
87361  tt9916190         2
87361  tt9916190        22
87362  tt9916362         7
87362  tt9916362        11

[163519 rows x 2 columns]

In [61]:
# Manually make dataframe with named columns from the .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})

In [62]:
genre_lookup

    Genre_Name  Genre_ID
0       Action         0
1        Adult         1
2    Adventure         2
3    Animation         3
4    Biography         4
5       Comedy         5
6        Crime         6
7        Drama         7
8       Family         8
9      Fantasy         9
10   Game-Show        10
11     History        11
12      Horror        12
13       Music        13
14     Musical        14
15     Mystery        15
16        News        16
17  Reality-TV        17
18     Romance        18
19      Sci-Fi        19
20       Sport        20
21   Talk-Show        21
22    Thriller        22
23         War        23
24     Western        24

Title Basics:
- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres

Title Ratings
- Movie ID (tconst)
- Average Movie Rating
- Number of Votes

The TMDB API Results (multiple files)
- Movie ID
- Revenue
- Budget
- Certification (MPAA Rating)

In [64]:
df_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror,[Horror]

In [66]:
df_basics_fin = df_basics[['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']]
df_basics_fin.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0068865,Lives of Performers,2016,90
3,tt0069049,The Other Side of the Wind,2018,122
4,tt0082328,Embodiment of Evil,2008,94

In [67]:
df_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2003
1  tt0000002            5.8       269
2  tt0000005            6.2      2681
3  tt0000006            5.0       183
4  tt0000007            5.4       839

In [69]:
df_ratings_fin = df_ratings
df_ratings_fin.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2003
1  tt0000002            5.8       269
2  tt0000005            6.2      2681
3  tt0000006            5.0       183
4  tt0000007            5.4       839

In [71]:
df_tmdb = pd.read_csv('C:\\Users\\javwyk\\OneDrive - MMI HOLDINGS LTD\\GitHub\\Github-practice-assignment\\data\\tmdb_results_combined.csv.gz', low_memory=False)

In [72]:
df_tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.450,10.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.102,2374.0,PG

In [74]:
df_tmdb_fin = df_tmdb[(df_tmdb['budget'] > 0) | (df_tmdb['revenue'] > 0)][['imdb_id', 'revenue', 'budget', 'certification']]
df_tmdb_fin.head()

      imdb_id     revenue      budget certification
1   tt0113026         0.0  10000000.0           NaN
4   tt0118694  14204632.0    150000.0            PG
6   tt0119273         0.0  15000000.0             R
10  tt0120202   9206279.0         0.0           NaN
11  tt0120263     80334.0         0.0           NaN

In [101]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = df_basics_fin['tconst'].fillna('').map(len).max()
title_len = df_basics_fin['primaryTitle'].fillna('').map(len).max()
cert_len = df_tmdb_fin['certification'].fillna('').map(len).max()
genre_name_len = genre_lookup['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "imdb_id": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    'startYear':Integer(),
    'endYear':Integer(),
    'runtimeMinutes':Integer(),
    'averageRating': Float(),
    'numVotes': Integer(),
    'budget': Float(),
    'revenue': Float(),
    'certification': String(cert_len+1),
    'genre_id': Integer(),
    'Genre_ID': Integer(),
    'Genre_Name': String(genre_name_len+1)}

In [93]:
# Save to sql with dtype and index=False
df_basics_fin.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

87363

In [94]:
# Save to sql with dtype and index=False
df_ratings_fin.to_sql('title_ratings',engine,dtype=df_schema,if_exists='replace',index=False)

512347

In [95]:
# Save to sql with dtype and index=False
df_tmdb_fin.to_sql('tmdb_info',engine,dtype=df_schema,if_exists='replace',index=False)

414

In [98]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=df_schema,if_exists='replace',index=False)

163519

In [102]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genre_lookup',engine,dtype=df_schema,if_exists='replace',index=False)

25

In [103]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [104]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [105]:
engine.execute('ALTER TABLE tmdb_info ADD PRIMARY KEY (`imdb_id`);')

In [107]:
engine.execute('ALTER TABLE genre_lookup ADD PRIMARY KEY (`Genre_ID`);')